number_1 = 1
number_2 = 1.1
string = 'qwerty'

lst = [1, 2, 3, "qwerty", number_2]

tpl = (1, "qwd")

flag = False

dct = {"name": "Eugene", "age": 27}
# print(f"Переменная имеет значение: {number_2}")
#
# print(f"Переменная имеет тип: {type(number_2)}")

# ______________________________________________

# a = 1
# b = 1

# print(a == b)
# print(a is b)
# print(a != b)
# print(a > b)
# print(a >= b)

# ______________________________________________
#
# a = 1
# a += 6  # a = a + 6
# a -= 6  # a = a - 6
# a *= 6  # a = a * 6
# a /= 6  # a = a / 6

# ______________________________________________
# a = 3
# if a == 1:
#     print("Переменная равна 1")
# elif a == 2:
#     print("Переменная равна 2")
# else:
#     print("Переменная не равна ни одному из установленных значений")
# ______________________________________________


# and
# or
# a = 1
# b = 2
# if a == 1 or b == 1:
#     print("Одно из чисел равно 1")
# elif a == 1 and b == 1:
#     print("Оба числа равно 1")
# else:
#     print("Ни одно из чисел не равно 1")

# ______________________________________________
# not
# a = 2
# if not a == 1:
#     print("Переменная не равна 1")
# else:
#     print("Переменная равна 1")

# is - по ячейке памяти
# == - по значение

# ______________________________________________
# a = 1
# b = 1
# print(a is b)
