# Необходимо написать программу которая проходит по списку абитуриентов, они вводят свои оценки по предметам.
# После чего программа сообщает поступил абитуриент или нет.

# Со звёздочкой: добавить ограничение количества мест в университете.

applicant_names = ["Петя", "Света", "Вася", "Алина", "Никита"]
success_number = 230

russian_mark = int(input("Введите количество баллов по русскому языку: "))
math_mark = int(input("Введите количество баллов по математике: "))
chemistry_mark = int(input("Введите количество баллов по химии: "))

